Yes. I ran `terraform apply` in master then switched to this branch and ran `terraform apply` again:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # netbox_ipam_ip_addresses.ip6_test will be created
  + resource "netbox_ipam_ip_addresses" "ip6_test" {
      + address      = "2001:db8::1234/64"
      + content_type = (known after apply)
      + id           = (known after apply)
      + object_id    = 1
      + object_type  = "virtualization.vminterface"
      + status       = "active"
    }

  # netbox_virtualization_vm_primary_ip.name will be created
  + resource "netbox_virtualization_vm_primary_ip" "name" {
      + id                = (known after apply)
      + primary_ip4_id    = 2
      + primary_ip6_id    = (known after apply)
      + virtualmachine_id = 25
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

Deleting the resource, removing either primary_ip field, even keeping the primary_ip4 or even switching back to it, works.

I just noticed everything is in place to write tests for this resource. I will do that.